In [1]:
# first import the libraries
import pandas as pd
   
# Create a dataFrame using dictionary
df=pd.DataFrame({"Name":['Tom','Nick','John','Peter'],
                 "Age":[15,26,17,28]})
  
# Creates a dataFrame with
# 2 columns and 4 rows
df

    Name  Age
0    Tom   15
1   Nick   26
2   John   17
3  Peter   28

In [5]:
df.columns=['col','col1']
df.index=[1,2,3,4]
df

     col  col1
1    Tom    15
2   Nick    26
3   John    17
4  Peter    28

In [11]:
data={'state':['ohio','neavda','ohio'],
     'year':[3444,7777,3444]}
f=pd.DataFrame(data)
f

    state  year
0    ohio  3444
1  neavda  7777
2    ohio  3444

In [14]:
fr2=pd.DataFrame(data,columns=[
    'state','year','ddbt','lang'])
fr2

    state  year ddbt lang
0    ohio  3444  NaN  NaN
1  neavda  7777  NaN  NaN
2    ohio  3444  NaN  NaN

In [23]:
fr2['lang']=45
fr2

    state  year ddbt  lang
0    ohio  3444  NaN    45
1  neavda  7777  NaN    45
2    ohio  3444  NaN    45

In [29]:
# lengths must match of df
val=pd.Series([8,7],index=[0,1])
fr2['lang']=val
fr2

    state  year ddbt  lang
0    ohio  3444  NaN   8.0
1  neavda  7777  NaN   7.0
2    ohio  3444  NaN   NaN

In [40]:
# assign a colu that doesnot exist will create a new one

fr2['ear']=fr2.state=='ohio'

fr2.columns

Index(['state', 'year', 'ddbt', 'lang', 'ear'], dtype='object')

In [45]:

fr2.values

array([['ohio', 3444, nan, 8.0],
       ['neavda', 7777, nan, 7.0],
       ['ohio', 3444, nan, nan]], dtype=object)

ValueError: No axis named 2 for object type DataFrame